# Importing libraries

In [4]:
#pip install word2number
import pandas as pd
import numpy as np
from sklearn import linear_model
from word2number import w2n

In [22]:
#print(w2n.word_to_num('point one'))

# Importing dataset

In [23]:
df = pd.read_csv("https://raw.githubusercontent.com/codebasics/py/master/ML/2_linear_reg_multivariate/Exercise/hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000


Let's update the column names

In [24]:
df.columns = ['experience','test_score','intv_score','salary']
df.columns

Index(['experience', 'test_score', 'intv_score', 'salary'], dtype='object')

# Data cleaning

In [25]:
df.experience = df.experience.fillna("zero")
df

  experience  test_score  intv_score  salary
0       zero         8.0           9   50000
1       zero         8.0           6   45000
2       five         6.0           7   60000
3        two        10.0          10   65000
4      seven         9.0           6   70000
5      three         7.0          10   62000
6        ten         NaN           7   72000
7     eleven         7.0           8   80000

In [26]:
df.experience = df.experience.apply(w2n.word_to_num)
df

   experience  test_score  intv_score  salary
0           0         8.0           9   50000
1           0         8.0           6   45000
2           5         6.0           7   60000
3           2        10.0          10   65000
4           7         9.0           6   70000
5           3         7.0          10   62000
6          10         NaN           7   72000
7          11         7.0           8   80000

In [29]:
df.test_score = df.test_score.fillna(df.test_score.median())
df

   experience  test_score  intv_score  salary
0           0         8.0           9   50000
1           0         8.0           6   45000
2           5         6.0           7   60000
3           2        10.0          10   65000
4           7         9.0           6   70000
5           3         7.0          10   62000
6          10         8.0           7   72000
7          11         7.0           8   80000

# Linear Regression Multivariate

In [30]:
reg = linear_model.LinearRegression()

In [31]:
reg.fit(df[['experience','test_score','intv_score']],df.salary)

LinearRegression()

In [34]:
pred = reg.predict([[2,9,6]])
pred

/Users/anikaislam/opt/anaconda3/lib/python3.9/site-packages/sklearn/base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([53205.96797671])

In [35]:
pred2 = reg.predict([[12,10,10]])
pred2

/Users/anikaislam/opt/anaconda3/lib/python3.9/site-packages/sklearn/base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([92002.18340611])